app/views/posts/create.js.erb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post"], ["content", "poster"], ["created_at", "2021-04-30 23:06:25.596240"], ["updated_at", "2021-04-30 23:06:25.596240"]]
---
document.getElementById('myPost').insertAdjacentHTML("beforeend","<%= escape_javascript render @post %>")