app/controllers/posts_controller.rb

  def index
    @post = Post.new
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    unless @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Prueba Titulo"], ["content", "Prueba Contenido test test"], ["created_at", "2021-04-30 22:26:02.604086"], ["updated_at", "2021-04-30 22:26:02.604086"]]

  def update
    @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "ret"], ["updated_at", "2021-07-14 17:23:31.861423"], ["id", 120]]