app/models/post.rb

    def self.full_search(word)
        self.all.select {|post| ( post.title.include?(word) || post.content.include?(word) ) }
---
SELECT "posts".* FROM "posts"